HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_reg.h
/** \brief 1B8, ISP Output Vertical Picture Size Shadow Register */
#define CIF_ISP_OUT_V_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE_SHD*)0xFA0025B8u)

/** \brief 1BC, ISP Interrupt Mask Register */
#define CIF_ISP_IMSC /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_IMSC*)0xFA0025BCu)

/** \brief 1C0, ISP Raw Interrupt Status Register */
#define CIF_ISP_RIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_RIS*)0xFA0025C0u)

/** \brief 1C4, ISP Masked Interrupt Status Register */
#define CIF_ISP_MIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_MIS*)0xFA0025C4u)

/** \brief 1C8, ISP Interrupt Clear Register */
#define CIF_ISP_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ICR*)0xFA0025C8u)

/** \brief 1CC, ISP Interrupt Set Register */
#define CIF_ISP_ISR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ISR*)0xFA0025CCu)

/** \brief 23C, ISP Error Register */
#define CIF_ISP_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ERR*)0xFA00263Cu)

/** \brief 240, ISP Error Clear Register */
#define CIF_ISP_ERR_CLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_ERR_CLR*)0xFA002640u)

/** \brief 244, ISP Frame Counter Register */
#define CIF_ISP_FRAME_COUNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_ISP_FRAME_COUNT*)0xFA002644u)

/** \brief 0, Memory Interface Global Control Register */
#define CIF_MI_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_CTRL*)0xFA003400u)

/** \brief 4, Memory Interface Control Register For Address Init And Skip Function Register */
#define CIF_MI_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_INIT*)0xFA003404u)

/** \brief 8, Memory Interface Base Address For Main Picture Y Component, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_BASE_AD_INIT*)0xFA003408u)

/** \brief C, Memory Interface Size of main picture Y component, JPEG or RAW data Register */
#define CIF_MI_MP_Y_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_SIZE_INIT*)0xFA00340Cu)

/** \brief 10, Memory Interface Offset Counter Init Value For Main Picture Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT*)0xFA003410u)

/** \brief 14, Memory Interface Offset Counter Start Value For Main Picture Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_START*)0xFA003414u)

/** \brief 18, Memory Interface Fill Level Interrupt Offset Value For Main Picture Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_IRQ_OFFS_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT*)0xFA003418u)

/** \brief 1C, Memory Interface Base Address For Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_INIT*)0xFA00341Cu)

/** \brief 20, Memory Interface Size Of Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_INIT*)0xFA003420u)

/** \brief 24, Memory Interface Offset Counter Init Value For Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT*)0xFA003424u)

/** \brief 28, Memory Interface Offset Counter Start Value For Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_START*)0xFA003428u)

/** \brief 2C, Memory Interface Base Address For Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_INIT*)0xFA00342Cu)

/** \brief 30, Memory Interface Size Of Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_INIT*)0xFA003430u)

/** \brief 34, Memory Interface Offset Counter Init value For Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT*)0xFA003434u)

/** \brief 38, Memory Interface Offset Counter Start Value For Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_START*)0xFA003438u)

/** \brief 70, Memory Interface Counter Value of JPEG or RAW Data Bytes Register */
#define CIF_MI_BYTE_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_BYTE_CNT*)0xFA003470u)

/** \brief 74, Memory Interface Global Control Internal Shadow Register */
#define CIF_MI_CTRL_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_CTRL_SHD*)0xFA003474u)

/** \brief 78, Memory Interface Base Address Shadow Register For Main Picture Y Component, JPEG Register */
#define CIF_MI_MP_Y_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_BASE_AD_SHD*)0xFA003478u)

/** \brief 7C, Memory Interface Size Shadow Register of Main Picture Y Component,JPEG or RAW Data Register */
#define CIF_MI_MP_Y_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_SIZE_SHD*)0xFA00347Cu)

/** \brief 80, Memory Interface Current Offset Counter of Main Picture Y Component JPEG or RAW Register */
#define CIF_MI_MP_Y_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD*)0xFA003480u)

/** \brief 84, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Main Picture Y Register */
#define CIF_MI_MP_Y_IRQ_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD*)0xFA003484u)

/** \brief 88, Memory Interface Base Address Shadow Register For Main Picture Cb Component Ring Register */
#define CIF_MI_MP_CB_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_SHD*)0xFA003488u)

/** \brief 8C, Memory Interface Size Shadow Register Of Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_SHD*)0xFA00348Cu)

/** \brief 90, Memory Interface Current Offset Counter Of Main Picture Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD*)0xFA003490u)

/** \brief 94, Memory Interface Base Address Shadow Register For Main Picture Cr Component Ring Register */
#define CIF_MI_MP_CR_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_SHD*)0xFA003494u)

/** \brief 98, Memory Interface Size Shadow Register Of Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_SHD*)0xFA003498u)

/** \brief 9C, Memory Interface Current Offset Counter Of Main Picture Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD*)0xFA00349Cu)

/** \brief F8, MI Interrupt Mask \u20181\u2019 interrupt active \u20180\u2019 interrupt masked */
#define CIF_MI_IMSC /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_IMSC*)0xFA0034F8u)

/** \brief FC, MI Raw Interrupt Status Register */
#define CIF_MI_RIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_RIS*)0xFA0034FCu)

/** \brief 100, MI Masked Interrupt Status Registe */
#define CIF_MI_MIS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_MIS*)0xFA003500u)

/** \brief 104, MI Interrupt Clear Register */
#define CIF_MI_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_ICR*)0xFA003504u)

/** \brief 108, MI Interrupt Set Register */
#define CIF_MI_ISR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_ISR*)0xFA003508u)

/** \brief 10C, MI Status Register */
#define CIF_MI_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_STATUS*)0xFA00350Cu)

/** \brief 110, MI Status Clear Register */
#define CIF_MI_STATUS_CLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MI_STATUS_CLR*)0xFA003510u)

/** \brief 0, JPE Command To Start Stream Header Generation Register */
#define CIF_JPE_GEN_HEADER /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_JPE_GEN_HEADER*)0xFA003800u)

