HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_reg.h
/** \brief 18, Extra Path 0 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_IC_1S0_MAX_DX /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DX*)0xFA004918u)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S0_MAX_DX.
*/
#define CIF_EP_0_IC_MAX_DX (CIF_EP_IC_1S0_MAX_DX)

/** \brief 1C, Extra Path 0 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_IC_1S0_MAX_DY /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DY*)0xFA00491Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S0_MAX_DY.
*/
#define CIF_EP_0_IC_MAX_DY (CIF_EP_IC_1S0_MAX_DY)

/** \brief 20, Extra Path 0 Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S0_DISPLACE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_DISPLACE*)0xFA004920u)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S0_DISPLACE.
*/
#define CIF_EP_0_IC_DISPLACE (CIF_EP_IC_1S0_DISPLACE)

/** \brief 24, Extra Path 0 Image Cropping Current Horizontal Offset of Output Window Shadow Register */
#define CIF_EP_IC_1S0_H_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS_SHD*)0xFA004924u)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_H_OFFS_SHD.
*/
#define CIF_EP_0_IC_H_OFFS_SHD (CIF_EP_IC_1S0_H_OFFS_SHD)

/** \brief 28, Extra Path 0 Image Cropping Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_IC_1S0_V_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS_SHD*)0xFA004928u)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_V_OFFS_SHD.
*/
#define CIF_EP_0_IC_V_OFFS_SHD (CIF_EP_IC_1S0_V_OFFS_SHD)

/** \brief 2C, Extra Path 0 Image Cropping Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_IC_1S0_H_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE_SHD*)0xFA00492Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_H_SIZE_SHD.
*/
#define CIF_EP_0_IC_H_SIZE_SHD (CIF_EP_IC_1S0_H_SIZE_SHD)

/** \brief 30, Extra Path 0 Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_IC_1S0_V_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE_SHD*)0xFA004930u)
/** Alias (User Manual Name) for CIF_EP_IC_1S0_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_V_SIZE_SHD.
*/
#define CIF_EP_0_IC_V_SIZE_SHD (CIF_EP_IC_1S0_V_SIZE_SHD)

/** \brief 100, Extra Path 1 Image Cropping Control Register */
#define CIF_EP_IC_1S1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_CTRL*)0xFA004A00u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S1_CTRL.
*/
#define CIF_EP_1_IC_CTRL (CIF_EP_IC_1S1_CTRL)

/** \brief 104, Extra Path 1 Image Cropping Recenter Register */
#define CIF_EP_IC_1S1_RECENTER /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_RECENTER*)0xFA004A04u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S1_RECENTER.
*/
#define CIF_EP_1_IC_RECENTER (CIF_EP_IC_1S1_RECENTER)

/** \brief 108, Extra Path 1 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_IC_1S1_H_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS*)0xFA004A08u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_OFFS.
*/
#define CIF_EP_1_IC_H_OFFS (CIF_EP_IC_1S1_H_OFFS)

/** \brief 10C, Extra Path 1 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_IC_1S1_V_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS*)0xFA004A0Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_OFFS.
*/
#define CIF_EP_1_IC_V_OFFS (CIF_EP_IC_1S1_V_OFFS)

/** \brief 110, Extra Path 1 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_IC_1S1_H_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE*)0xFA004A10u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_SIZE.
*/
#define CIF_EP_1_IC_H_SIZE (CIF_EP_IC_1S1_H_SIZE)

/** \brief 114, Extra Path 1 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_IC_1S1_V_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE*)0xFA004A14u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_SIZE.
*/
#define CIF_EP_1_IC_V_SIZE (CIF_EP_IC_1S1_V_SIZE)

/** \brief 118, Extra Path 1 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_IC_1S1_MAX_DX /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DX*)0xFA004A18u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S1_MAX_DX.
*/
#define CIF_EP_1_IC_MAX_DX (CIF_EP_IC_1S1_MAX_DX)

/** \brief 11C, Extra Path 1 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_IC_1S1_MAX_DY /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DY*)0xFA004A1Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S1_MAX_DY.
*/
#define CIF_EP_1_IC_MAX_DY (CIF_EP_IC_1S1_MAX_DY)

/** \brief 120, Extra Path 1 Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S1_DISPLACE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_DISPLACE*)0xFA004A20u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S1_DISPLACE.
*/
#define CIF_EP_1_IC_DISPLACE (CIF_EP_IC_1S1_DISPLACE)

/** \brief 124, Extra Path 1 Image Cropping Current Horizontal Offset of Output Window Shadow Register */
#define CIF_EP_IC_1S1_H_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS_SHD*)0xFA004A24u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_OFFS_SHD.
*/
#define CIF_EP_1_IC_H_OFFS_SHD (CIF_EP_IC_1S1_H_OFFS_SHD)

/** \brief 128, Extra Path 1 Image Cropping Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_IC_1S1_V_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS_SHD*)0xFA004A28u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_OFFS_SHD.
*/
#define CIF_EP_1_IC_V_OFFS_SHD (CIF_EP_IC_1S1_V_OFFS_SHD)

/** \brief 12C, Extra Path 1 Image Cropping Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_IC_1S1_H_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE_SHD*)0xFA004A2Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_SIZE_SHD.
*/
#define CIF_EP_1_IC_H_SIZE_SHD (CIF_EP_IC_1S1_H_SIZE_SHD)

/** \brief 130, Extra Path 1 Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_IC_1S1_V_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE_SHD*)0xFA004A30u)
/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_SIZE_SHD.
*/
#define CIF_EP_1_IC_V_SIZE_SHD (CIF_EP_IC_1S1_V_SIZE_SHD)

/** \brief 200, Extra Path 2 Image Cropping Control Register */
#define CIF_EP_IC_1S2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_CTRL*)0xFA004B00u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S2_CTRL.
*/
#define CIF_EP_2_IC_CTRL (CIF_EP_IC_1S2_CTRL)

/** \brief 204, Extra Path 2 Image Cropping Recenter Register */
#define CIF_EP_IC_1S2_RECENTER /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_RECENTER*)0xFA004B04u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S2_RECENTER.
*/
#define CIF_EP_2_IC_RECENTER (CIF_EP_IC_1S2_RECENTER)

/** \brief 208, Extra Path 2 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_IC_1S2_H_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS*)0xFA004B08u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_OFFS.
*/
#define CIF_EP_2_IC_H_OFFS (CIF_EP_IC_1S2_H_OFFS)

/** \brief 20C, Extra Path 2 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_IC_1S2_V_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS*)0xFA004B0Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_OFFS.
*/
#define CIF_EP_2_IC_V_OFFS (CIF_EP_IC_1S2_V_OFFS)

/** \brief 210, Extra Path 2 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_IC_1S2_H_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE*)0xFA004B10u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_SIZE.
*/
#define CIF_EP_2_IC_H_SIZE (CIF_EP_IC_1S2_H_SIZE)

