HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_reg.h
/** \brief 214, Extra Path 2 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_IC_1S2_V_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE*)0xFA004B14u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_SIZE.
*/
#define CIF_EP_2_IC_V_SIZE (CIF_EP_IC_1S2_V_SIZE)

/** \brief 218, Extra Path 2 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_IC_1S2_MAX_DX /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DX*)0xFA004B18u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S2_MAX_DX.
*/
#define CIF_EP_2_IC_MAX_DX (CIF_EP_IC_1S2_MAX_DX)

/** \brief 21C, Extra Path 2 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_IC_1S2_MAX_DY /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DY*)0xFA004B1Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S2_MAX_DY.
*/
#define CIF_EP_2_IC_MAX_DY (CIF_EP_IC_1S2_MAX_DY)

/** \brief 220, Extra Path 2 Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S2_DISPLACE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_DISPLACE*)0xFA004B20u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S2_DISPLACE.
*/
#define CIF_EP_2_IC_DISPLACE (CIF_EP_IC_1S2_DISPLACE)

/** \brief 224, Extra Path 2 Image Cropping Current Horizontal Offset of Output Window Shadow Register */
#define CIF_EP_IC_1S2_H_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS_SHD*)0xFA004B24u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_OFFS_SHD.
*/
#define CIF_EP_2_IC_H_OFFS_SHD (CIF_EP_IC_1S2_H_OFFS_SHD)

/** \brief 228, Extra Path 2 Image Cropping Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_IC_1S2_V_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS_SHD*)0xFA004B28u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_OFFS_SHD.
*/
#define CIF_EP_2_IC_V_OFFS_SHD (CIF_EP_IC_1S2_V_OFFS_SHD)

/** \brief 22C, Extra Path 2 Image Cropping Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_IC_1S2_H_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE_SHD*)0xFA004B2Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_H_SIZE_SHD.
*/
#define CIF_EP_2_IC_H_SIZE_SHD (CIF_EP_IC_1S2_H_SIZE_SHD)

/** \brief 230, Extra Path 2 Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_IC_1S2_V_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE_SHD*)0xFA004B30u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_SIZE_SHD.
*/
#define CIF_EP_2_IC_V_SIZE_SHD (CIF_EP_IC_1S2_V_SIZE_SHD)

/** \brief 300, Extra Path 3 Image Cropping Control Register */
#define CIF_EP_IC_1S3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_CTRL*)0xFA004C00u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S3_CTRL.
*/
#define CIF_EP_3_IC_CTRL (CIF_EP_IC_1S3_CTRL)

/** \brief 304, Extra Path 3 Image Cropping Recenter Register */
#define CIF_EP_IC_1S3_RECENTER /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_RECENTER*)0xFA004C04u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S3_RECENTER.
*/
#define CIF_EP_3_IC_RECENTER (CIF_EP_IC_1S3_RECENTER)

/** \brief 308, Extra Path 3 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_IC_1S3_H_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS*)0xFA004C08u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_OFFS.
*/
#define CIF_EP_3_IC_H_OFFS (CIF_EP_IC_1S3_H_OFFS)

/** \brief 30C, Extra Path 3 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_IC_1S3_V_OFFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS*)0xFA004C0Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_OFFS.
*/
#define CIF_EP_3_IC_V_OFFS (CIF_EP_IC_1S3_V_OFFS)

/** \brief 310, Extra Path 3 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_IC_1S3_H_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE*)0xFA004C10u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_SIZE.
*/
#define CIF_EP_3_IC_H_SIZE (CIF_EP_IC_1S3_H_SIZE)

/** \brief 314, Extra Path 3 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_IC_1S3_V_SIZE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE*)0xFA004C14u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_SIZE.
*/
#define CIF_EP_3_IC_V_SIZE (CIF_EP_IC_1S3_V_SIZE)

/** \brief 318, Extra Path 3 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_IC_1S3_MAX_DX /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DX*)0xFA004C18u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S3_MAX_DX.
*/
#define CIF_EP_3_IC_MAX_DX (CIF_EP_IC_1S3_MAX_DX)

/** \brief 31C, Extra Path 3 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_IC_1S3_MAX_DY /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DY*)0xFA004C1Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S3_MAX_DY.
*/
#define CIF_EP_3_IC_MAX_DY (CIF_EP_IC_1S3_MAX_DY)

/** \brief 320, Extra Path 3 Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S3_DISPLACE /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_EP_IC_1S_DISPLACE*)0xFA004C20u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_DISPLACE.
*/
#define CIF_EP_3_IC_DISPLACE (CIF_EP_IC_1S3_DISPLACE)

