HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_reg.h
/** \brief 400, Memory Interface Extra Path 3 Control Register */
#define CIF_MIEP_CH_1S3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL*)0xFA005800u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_CTRL.
*/
#define CIF_MIEP_3_CTRL (CIF_MIEP_CH_1S3_CTRL)

/** \brief 404, Memory Interface Extra Path 3 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S3_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005804u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_INIT.
*/
#define CIF_MIEP_3_INIT (CIF_MIEP_CH_1S3_INIT)

/** \brief 408, Memory Interface Base Address for Extra Path 3 Data Buffer Register */
#define CIF_MIEP_CH_1S3_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005808u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_BASE_AD_INIT.
*/
#define CIF_MIEP_3_BASE_AD_INIT (CIF_MIEP_CH_1S3_BASE_AD_INIT)

/** \brief 40C, Memory Interface Size of Extra Path 3 Data Buffer Register */
#define CIF_MIEP_CH_1S3_SIZE_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00580Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_SIZE_INIT.
*/
#define CIF_MIEP_3_SIZE_INIT (CIF_MIEP_CH_1S3_SIZE_INIT)

/** \brief 410, Memory Interface Offset Counter Init Value For Extra Path 3 Buffer Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005810u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_INIT.
*/
#define CIF_MIEP_3_OFFS_CNT_INIT (CIF_MIEP_CH_1S3_OFFS_CNT_INIT)

/** \brief 414, Memory Interface Offset Counter Start Value for Extra Path 3 Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_START /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005814u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_START.
*/
#define CIF_MIEP_3_OFFS_CNT_START (CIF_MIEP_CH_1S3_OFFS_CNT_START)

/** \brief 418, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S3_IRQ_OFFS_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005818u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_3_IRQ_OFFS_INIT (CIF_MIEP_CH_1S3_IRQ_OFFS_INIT)

/** \brief 41C, Memory Interface Extra Path 3 Control Internal Shadow Register */
#define CIF_MIEP_CH_1S3_CTRL_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL_SHD*)0xFA00581Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_CTRL_SHD.
*/
#define CIF_MIEP_3_CTRL_SHD (CIF_MIEP_CH_1S3_CTRL_SHD)

/** \brief 420, Memory Interface Base Address Shadow Register for Extra Path 3 Buffer Register */
#define CIF_MIEP_CH_1S3_BASE_AD_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD*)0xFA005820u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_BASE_AD_SHD.
*/
#define CIF_MIEP_3_BASE_AD_SHD (CIF_MIEP_CH_1S3_BASE_AD_SHD)

/** \brief 424, Memory Interface Size Shadow Register of Extra Path 3 Buffer Register */
#define CIF_MIEP_CH_1S3_SIZE_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_SHD*)0xFA005824u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_SIZE_SHD.
*/
#define CIF_MIEP_3_SIZE_SHD (CIF_MIEP_CH_1S3_SIZE_SHD)

/** \brief 428, Memory Interface Current Offset Counter of Extra Path 3 Buffer Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD*)0xFA005828u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_SHD.
*/
#define CIF_MIEP_3_OFFS_CNT_SHD (CIF_MIEP_CH_1S3_OFFS_CNT_SHD)

/** \brief 42C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 3 Register */
#define CIF_MIEP_CH_1S3_IRQ_OFFS_SHD /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD*)0xFA00582Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_IRQ_OFFS_SHD.
*/
#define CIF_MIEP_3_IRQ_OFFS_SHD (CIF_MIEP_CH_1S3_IRQ_OFFS_SHD)

/** \brief 500, Memory Interface Extra Path 4 Control Register */
#define CIF_MIEP_CH_1S4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL*)0xFA005900u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_CTRL.
*/
#define CIF_MIEP_4_CTRL (CIF_MIEP_CH_1S4_CTRL)

/** \brief 504, Memory Interface Extra Path 4 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S4_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005904u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_INIT.
*/
#define CIF_MIEP_4_INIT (CIF_MIEP_CH_1S4_INIT)

/** \brief 508, Memory Interface Base Address for Extra Path 4 Data Buffer Register */
#define CIF_MIEP_CH_1S4_BASE_AD_INIT /*lint --e(923, 9078)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005908u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_BASE_AD_INIT.
*/
#define CIF_MIEP_4_BASE_AD_INIT (CIF_MIEP_CH_1S4_BASE_AD_INIT)

